# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
# brew 'mas'

# Se connecter au Mac App Store (avec la boite de diaglogue)
# mas signin --dialog 'your@email.com'

# Utilitaires
cask 'coconutbattery'
cask 'flux'
cask 'appcleaner'
cask 'spectacle'
cask 'the-unarchiver'
brew 'qlmarkdown'
brew 'quicklook-json'
brew 'webpquicklook'

# Navigateurs
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'curl'
brew 'wget'
brew 'git'
brew 'node'
brew 'zsh'
brew 'zsh-completions'
brew 'rbenv'
brew 'composer'
cask 'iterm2'
cask 'mamp'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'linear-linear'
cask 'docker'

# Privacy
cask 'nordvpn'
cask '1password'
cask 'bitwarden'

# Design
cask 'adobe-creative-cloud'
cask 'imageoptim'
cask 'sketch'
cask 'figma'

# Multimedia
cask 'spotify'
cask 'vlc'
cask 'kap'

# Autres (communication, bureautique, etc.)
cask 'skype'
cask 'slack'
cask 'zoom'
cask 'telegram-desktop'
cask 'grammarly'
