# Taps
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-php'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Se connecter au Mac App Store (avec la boite de diaglogue)
# mas signin --dialog 'contact@christophe-hermann.fr'

# Utilitaires
cask 'coconutbattery'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'flux'
cask 'appcleaner'
cask 'spectacle'
mas 'The Unarchiver', id: 425424353

# Navigateurs
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'wget'
brew 'git'
brew 'node'
brew 'dnsmasq'
brew 'php71', args: ['with-httpd24']
brew 'zsh'
brew 'zsh-completions'
cask 'iterm2'
cask 'sequel-pro'
cask 'sourcetree'
cask 'sublime-text'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'github-desktop'
cask 'font-roboto-mono'

# Privacy
cask 'nordvpn'
mas '1Password', id: 443987910

# Design
cask 'adobe-creative-cloud'
cask 'imageoptim'

# Multimedia
cask 'spotify'
cask 'vlc'

# Autres (communication, bureautique, etc.)
cask 'skype'
cask 'libreoffice'
cask 'macdown'
mas 'Slack', id: 803453959
